app/views/articles/_form.html.erb

    <%= f.label 'File under at least one category' %>
    <% Category.all.order(category_name: :asc).each do |category| %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."category_name" ASC