app/views/articles/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 51]]
---
			<p>Published on <%= article.created_at.strftime('%b %d, %Y') %></p>
			<p>Filed under: <% article.categories.each do |category| %>