app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 1]]
---
	<div><%= simple_format(@article.content) %></div>
	<p class="lead">Filed under: <strong><% @article.categories.each do |category| %>