app/controllers/articles_controller.rb

  def index
  	@articles = Article.order(updated_at: :desc).limit(25)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC LIMIT 25