app/controllers/categories_controller.rb

  def index
  	@categories = Category.all.order(:category_name)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."category_name" ASC

  def show
  	@category = Category.find(params[:id])
  	@articles = Category.find(params[:id]).articles
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 4]]