app/controllers/users_controller.rb

def create
	@user = User.new(user_params)
	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"