app/controllers/welcome_controller.rb

  def index
  	@recentart = Article.all.order(updated_at: :desc).limit(5)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC LIMIT 5