app/views/categories/show.html.erb

		</tr>
	<% @category.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 4]]